Repository: tekle-eyesus/MediScan
Catalog: mobile_app/lib/l10n/app_*.arb
Languages: am

source: Scan
am: ስካን

source: History
am: ታሪክ

source: Settings
am: ቅንብሮች

# appTitle
source: MediScan Ethiopia
am: ሜዲ-ስካን ኢትዮጵያ

# dateLabel
source: Date:
am: ቀን፦

# patientIdLabel
source: Patient ID:
am: የታካሚ መታወቂያ፦

# doctorLabel
source: Doctor:
am: ሐኪም፦

# idLabel
source: ID:
am: መታወቂያ፦

# facilityLabel
source: Facility:
am: ተቋም፦

source: Original X-Ray
am: ኦሪጅናል ኤክስሬይ

source: AI Analysis
am: የአርቴፊሻል ኢንተለጀንስ (AI) ትንታኔ

# findingsLabel
source: Findings:
am: ግኝቶች፦

# aiAnalysisResult
source: The AI system has analyzed the chest X-ray. The analysis indicates a {confidence}% probability of {prediction}. Please correlate with clinical symptoms.
am: የአርቴፊሻል ኢንተለጀንስ ስርዓቱ የደረት ኤክስሬዩን መርምሯል። ትንታኔው {confidence}% የ{prediction} እድል መኖሩን ያሳያል። እባክዎን ከህክምና ምልክቶች ጋር ያነጻጽሩት።

# disclaimer
source: Electronically generated by MediScan AI. Not a final diagnosis.
am: በሜዲ-ስካን AI በኤሌክትሮኒክ መንገድ የተዘጋጀ። የመጨረሻ ምርመራ አይደለም።

source: Reset
am: እንደገና አስጀምር

# uploadXray
source: Upload X-Ray to Analyze
am: ለመመርመር ኤክስሬይ ይጫኑ

source: Camera
am: ካሜራ

source: Gallery
am: ጋለሪ

source: RUN AI DIAGNOSIS
am: የAI ምርመራ አከናውን

source: Heatmap
am: የሙቀት ካርታ (Heatmap)

source: Diagnosis Result
am: የምርመራ ውጤት

source: Abnormality Detected
am: ያልተለመደ ነገር ተገኝቷል

source: Healthy Lungs
am: ጤናማ ሳንባ

source: GENERATE MEDICAL REPORT
am: የህክምና ሪፖርት አውጣ

source: PNEUMONIA
am: የሳንባ ምች

# historyTitle
source: Patient Records
am: የታካሚ መዝገቦች

source: No records found
am: ምንም መዝገብ አልተገኘም

source: Record deleted
am: መዝገቡ ተሰርዟል

# patientPrefix
source: Patient:
am: ታካሚ:

# doctorPrefix
source: Dr:
am: ዶ/ር:

# confidencePrefix
source: Confidence:
am: እርግጠኝነት:
